
Функция СписокПредложенийПолучить(Запрос)
	
	СтруктураОтвета = Сервисы.ПолучитьБазовуюСтруктуруОтвета();
	СписокСервисов = СервисОбъектыНедвижимости.ПолучитьСписокСервисов();
	
	Ответ = Новый HTTPСервисОтвет(200);
	СтруктураОтвета.data.Вставить("offers", СписокСервисов);
	
	Сервисы.УстановитьТипСодержимогоJSON(Ответ);
	ПодготовленныйJSON = Сервисы.КонвертироватьОбъектВДжейсон(СтруктураОтвета);
	
	Ответ.УстановитьТелоИзСтроки(ПодготовленныйJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;
	
КонецФункции

Функция СписокПредложенийДобавить(Запрос)
	
	СтруктураОтвета = Сервисы.ПолучитьБазовуюСтруктуруОтвета();
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	ДанныеЗапроса = Сервисы.КонвертиротьДжейсонВСтруктуру(ТелоЗапроса, Новый Массив);
	НовыйЭлемент = СервисОбъектыНедвижимости.СоздатьНовыйСервис(ДанныеЗапроса);
	
	Если НЕ ЗначениеЗаполнено(НовыйЭлемент) Тогда
		СтруктураОтвета.ok = Ложь;
		СтруктураОтвета.description = "Can't create new element. Check your data and try again";
	Иначе
		СтруктураОтвета.data.Вставить("id", Строка(НовыйЭлемент.УникальныйИдентификатор()));
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Сервисы.УстановитьТипСодержимогоJSON(Ответ);
	ПодготовленныйJSON = Сервисы.КонвертироватьОбъектВДжейсон(СтруктураОтвета);
	
	Ответ.УстановитьТелоИзСтроки(ПодготовленныйJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;
	
КонецФункции