
Функция ПолучитьПредставлениеКоординат()
	Результат = Новый Структура;
	Результат.Вставить("x", 0);
	Результат.Вставить("y", 0);
	
	Возврат Результат;
КонецФункции

Функция ПолучитьПредставлениеПредложения()
	Результат = Новый Структура;
	
	Результат.Вставить("title", "");
	Результат.Вставить("address", "");
	Результат.Вставить("price", 0);
	Результат.Вставить("type", "");
	Результат.Вставить("rooms", 0);
	Результат.Вставить("guests", 0);
	Результат.Вставить("checkin", "");
	Результат.Вставить("checkout", ""); 
	Результат.Вставить("features", Новый Массив);
	Результат.Вставить("description", "");
	Результат.Вставить("photos", Новый Массив);
	
	Возврат Результат;
КонецФункции

Функция ПолучитьБазовуюСтруктуруОтвета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("id", "");
	Результат.Вставить("author", Новый Структура("avatar", ""));
	Результат.Вставить("offer", ПолучитьПредставлениеПредложения());
	Результат.Вставить("location", ПолучитьПредставлениеКоординат());
	
	Возврат Результат;
	
КонецФункции