
Функция ПолучитьСписокСервисов() Экспорт
	
	Результат = Новый Массив;
	СписокСервисов = Справочники.ОбъектыНедвижимости.ПолучитьСписок();
	
	Для Каждого Сервис Из СписокСервисов Цикл
		Результат.Добавить(Конверторы.СервисВСтруктуру(Сервис));		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьНовыйСервис(СтруктураДанных) Экспорт	
	Результат = Справочники.ОбъектыНедвижимости.ПустаяСсылка();
	
	НовыйЭлемент = Справочники.ОбъектыНедвижимости.СоздатьЭлемент();
	НовыйЭлемент.Наименование = СтруктураДанных.offer.title;
	НовыйЭлемент.Адрес = СтруктураДанных.offer.address;
	НовыйЭлемент.ВидЖилья = Конверторы.СтрокаВВидЖилья(СтруктураДанных.offer.type);
	НовыйЭлемент.ЦенаЗаНочь = СтруктураДанных.offer.price;
	НовыйЭлемент.КоличествоКомнат = Конверторы.СтрокаВКоличествоКомнат(СтруктураДанных.offer.rooms);
	НовыйЭлемент.КоличествоМест = Конверторы.СтрокаВКоличествоМест(СтруктураДанных.offer.guests);
	НовыйЭлемент.ВремяЗаезда = Конверторы.СтрокаВВремяЗаезда(СтруктураДанных.offer.checkin);
	НовыйЭлемент.ВремяВыезда = Конверторы.СтрокаВВремяВыезда(СтруктураДанных.offer.checkout);
	НовыйЭлемент.Описание = СтруктураДанных.offer.description;
	НовыйЭлемент.КоординатаХ = СтруктураДанных.location.x;
	НовыйЭлемент.КоординатаУ = СтруктураДанных.location.y;
	
	Для Каждого Опция Из СтруктураДанных.offer.features Цикл
		НоваяОпция = НовыйЭлемент.ВидыУдобств.Добавить();
		НоваяОпция.Опция = Конверторы.СтрокаВВидУдобства(Опция);
	КонецЦикла;
	
	Попытка
		НовыйЭлемент.Записать();
	Исключение
		Возврат Результат;
	КонецПопытки;
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции