Функция ПолучитьБазовуюСтруктуруОтвета() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ok", Истина);
	Результат.Вставить("update", Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy HH:mm:ss'"));
	Результат.Вставить("description", "");
	Результат.Вставить("errors", Новый Массив);
	Результат.Вставить("data", Новый Структура);
	
	Возврат Результат;
КонецФункции

Процедура УстановитьТипСодержимогоJSON(ОбъектОтвета) Экспорт
	ОбъектОтвета.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
КонецПроцедуры

Функция КонвертироватьОбъектВДжейсон(СтруктураДанных) Экспорт

	Результат = Неопределено;  	
	МенеджерЗаписиJSON = Новый ЗаписьJSON;	
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб,,,,,,, Ложь);
	МенеджерЗаписиJSON.УстановитьСтроку(ПараметрыЗаписиJSON);

	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;

	ЗаписатьJSON(МенеджерЗаписиJSON, СтруктураДанных, НастройкиСериализации);	

	Результат = МенеджерЗаписиJSON.Закрыть();

	Возврат Результат;

КонецФункции

Функция КонвертиротьДжейсонВСтруктуру(СтрокаJSON, МассивПолейДата) Экспорт
	Результат = Неопределено;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка		
		Результат = ПрочитатьJSON(ЧтениеJSON,, МассивПолейДата);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции
